# Pandas介绍
+ 作者Wes Mckinney，项目开始于2008年
+ 基于NumPy构建

亮点：
+ 快速高效的数据操作
+ 方便的读写不同数据源
+ 数据对齐和缺失数据处理
+ 数据聚合
+ 合并和连接数据
+ 时间序列处理
+ 应用广泛（金融、经济学、统计学等）

# Pandas数据结构

In [1]:
# Series 创建
import pandas as pd
s = pd.Series([4, 5, 3, 1])

In [2]:
# 获取数值
print(s.values)

[4 5 3 1]

In [3]:
# 获取索引
print(s.index)

RangeIndex(start=0, stop=4, step=1)

In [4]:
# 显式指定索引
s2 = pd.Series([4, 5, 3, 1], index=['a', 'b', 'c', 'd'])
print(s2.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
# 通过索引选取值
print(s2['a'])
s2['a'] = 6
s2[['a','b']]

4

a    6
b    5
dtype: int64

In [6]:
# 数组运算
import numpy as np
s2[s2>0]
s2*2
np.exp(s2)

a    403.428793
b    148.413159
c     20.085537
d      2.718282
dtype: float64

In [7]:
# 判断索引是否存在
'b' in s2
'e' in s2

False

In [8]:
# 通过字典创建Series
data = {'shanghai': 1, 'beijing': 2, 'shenzhen': 3}
s3 = pd.Series(data)

In [9]:
# 检查缺失值
s3['guangzhou'] = np.nan
s3.isnull()

shanghai     False
beijing      False
shenzhen     False
guangzhou     True
dtype: bool

In [10]:
# 按索引自动对齐
s4 = pd.Series({'shanghai': 1, 'beijing': 2, 'chongqing': 3})
s3 + s4

beijing      4.0
chongqing    NaN
guangzhou    NaN
shanghai     2.0
shenzhen     NaN
dtype: float64

In [11]:
# Series的name属性
s3.name = 'population'
s3.index.name = 'city'

In [12]:
# DataFrame 创建
data = {'year': [2017, 2018, 2019],
    'revenue': [10, 20, 30]}
df = pd.DataFrame(data)

In [13]:
# 指定列序列
df = pd.DataFrame(data, columns=['year', 'revenue'])

In [14]:
# 指定索引
df = pd.DataFrame(data, index=[4, 5, 6])

In [15]:
# 设置索引列
df.set_index('year', inplace=True)

In [16]:
# 通过传入Series创建DataFrame
s1 = pd.Series([1,2,3])
s2 = pd.Series([4,5,6])
df = pd.DataFrame({'A': s1, 'B': s2})

In [17]:
# 通过传入ndarray创建DataFrame
a1 = np.array([1,2,3])
a2 = np.array([4,5,6])
df = pd.DataFrame({'A': a1, 'B': a2})

In [18]:
# 创建带时间索引的DataFrame
dates = pd.date_range('2019-01-01', periods=6)
df = pd.DataFrame(np.random.randn(6,3), index=dates, columns=list('ABC'))

# 练习一 - 见PPT

# 查看数据

In [19]:
# 查看顶部数据
df.head()

                   A         B         C
2019-01-01 -0.434949  0.891520 -1.105683
2019-01-02  0.864498 -0.459478 -1.566731
2019-01-03 -0.921046 -0.040331  1.092931
2019-01-04  1.132698 -1.450461 -0.672566
2019-01-05  0.095900 -0.298943 -1.189325

In [20]:
# 查看底部数据
df.tail(3)

                   A         B         C
2019-01-04  1.132698 -1.450461 -0.672566
2019-01-05  0.095900 -0.298943 -1.189325
2019-01-06  0.434207  0.499515  0.247998

In [21]:
# 显示索引
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
# 显示列
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [23]:
# 显示数据的统计摘要
df.describe()

              A         B         C
count  6.000000  6.000000  6.000000
mean   0.195218 -0.143030 -0.532229
std    0.779351  0.815785  1.009992
min   -0.921046 -1.450461 -1.566731
25%   -0.302237 -0.419344 -1.168415
50%    0.265054 -0.169637 -0.889125
75%    0.756925  0.364553  0.017857
max    1.132698  0.891520  1.092931

In [24]:
# 转置数据
df.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A   -0.434949    0.864498   -0.921046    1.132698    0.095900    0.434207
B    0.891520   -0.459478   -0.040331   -1.450461   -0.298943    0.499515
C   -1.105683   -1.566731    1.092931   -0.672566   -1.189325    0.247998

In [25]:
# 按轴排序
df.sort_index(axis=1, ascending=False)

                   C         B         A
2019-01-01 -1.105683  0.891520 -0.434949
2019-01-02 -1.566731 -0.459478  0.864498
2019-01-03  1.092931 -0.040331 -0.921046
2019-01-04 -0.672566 -1.450461  1.132698
2019-01-05 -1.189325 -0.298943  0.095900
2019-01-06  0.247998  0.499515  0.434207

In [26]:
# 按值排序
dates = pd.date_range('2019-01-01', periods=6)
df = pd.DataFrame(np.random.randn(6,3), index=dates, columns=list('ABC'))
df.sort_values(by='B')

                   A         B         C
2019-01-05  2.574851 -0.625801 -0.057813
2019-01-04 -0.484171 -0.129485  0.288674
2019-01-06 -0.114704  0.135280  0.347109
2019-01-01  0.579449  0.261961  0.188524
2019-01-02 -0.637200  0.333428  0.629147
2019-01-03  0.988711  0.698638 -0.735962

# 选择数据

In [27]:
# 选择一个列
df['A']

2019-01-01    0.579449
2019-01-02   -0.637200
2019-01-03    0.988711
2019-01-04   -0.484171
2019-01-05    2.574851
2019-01-06   -0.114704
Freq: D, Name: A, dtype: float64

In [28]:
# 切片操作
df[1:3]
df['2019-01-02':'2019-01-05']

                   A         B         C
2019-01-02 -0.637200  0.333428  0.629147
2019-01-03  0.988711  0.698638 -0.735962
2019-01-04 -0.484171 -0.129485  0.288674
2019-01-05  2.574851 -0.625801 -0.057813

In [29]:
# 选择多列数据
df.loc[:, ['A', 'B']]

                   A         B
2019-01-01  0.579449  0.261961
2019-01-02 -0.637200  0.333428
2019-01-03  0.988711  0.698638
2019-01-04 -0.484171 -0.129485
2019-01-05  2.574851 -0.625801
2019-01-06 -0.114704  0.135280

In [30]:
# 在两个轴上切片
df.loc['2019-01-02':'2019-01-05', ['A','B']]

                   A         B
2019-01-02 -0.637200  0.333428
2019-01-03  0.988711  0.698638
2019-01-04 -0.484171 -0.129485
2019-01-05  2.574851 -0.625801

In [31]:
# 获取一行
df.loc['2019-01-05']

A    2.574851
B   -0.625801
C   -0.057813
Name: 2019-01-05 00:00:00, dtype: float64

In [32]:
# 获取某一行的某一列
df.loc['2019-01-02', 'A']
df.at['2019-01-02', 'A']

-0.6371999421829624

In [33]:
# 按位置选择
df.iloc[3]

A   -0.484171
B   -0.129485
C    0.288674
Name: 2019-01-04 00:00:00, dtype: float64

In [34]:
# 通过整数切片
df.iloc[3:5, 0:2]

                   A         B
2019-01-04 -0.484171 -0.129485
2019-01-05  2.574851 -0.625801

In [35]:
# 整行切片
df.iloc[3:5, :]

                   A         B         C
2019-01-04 -0.484171 -0.129485  0.288674
2019-01-05  2.574851 -0.625801 -0.057813

In [36]:
# 整列切片
df.iloc[:, 0:2]

                   A         B
2019-01-01  0.579449  0.261961
2019-01-02 -0.637200  0.333428
2019-01-03  0.988711  0.698638
2019-01-04 -0.484171 -0.129485
2019-01-05  2.574851 -0.625801
2019-01-06 -0.114704  0.135280

In [37]:
# 获取某一行某一列
df.iloc[1, 1]
df.iat[1, 1]

0.3334276672880811

In [38]:
# 使用单个列的值来选择数据
df[df.A > 0]

                   A         B         C
2019-01-01  0.579449  0.261961  0.188524
2019-01-03  0.988711  0.698638 -0.735962
2019-01-05  2.574851 -0.625801 -0.057813

In [39]:
# 选择满足布尔条件的值
df[df > 0]

                   A         B         C
2019-01-01  0.579449  0.261961  0.188524
2019-01-02       NaN  0.333428  0.629147
2019-01-03  0.988711  0.698638       NaN
2019-01-04       NaN       NaN  0.288674
2019-01-05  2.574851       NaN       NaN
2019-01-06       NaN  0.135280  0.347109

In [40]:
# 新增列
df["D"] = [1,2,3,4,5,6]

# 精确匹配索引
s1 = pd.Series([6,5,4,3,2,1], index=pd.date_range('2019-01-01', periods=6))
df["D"] = s1

# 指定列名赋值
df.loc['2019-01-01', 'A'] = 0

In [41]:
# 通过位置赋值
df.iloc[0,1] = 0

# 使用NumPy数组赋值
df.loc[:, 'D'] = np.array([6] * len(df))

# 条件赋值
df[df < 0] = -df

# 练习二 - 见PPT

# 缺失值处理

In [42]:
# Pandas中用np.nan来表示缺失的数据
df.loc['2019-01-02', 'A'] = np.nan
df.loc['2019-01-03', 'B'] = np.nan

In [43]:
# 删除带有缺失值的行
df.dropna(how='any')

                   A         B         C  D
2019-01-01  0.000000  0.000000  0.188524  6
2019-01-04  0.484171  0.129485  0.288674  6
2019-01-05  2.574851  0.625801  0.057813  6
2019-01-06  0.114704  0.135280  0.347109  6

In [44]:
# 填充缺失值
df.fillna(value=5)

                   A         B         C  D
2019-01-01  0.000000  0.000000  0.188524  6
2019-01-02  5.000000  0.333428  0.629147  6
2019-01-03  0.988711  5.000000  0.735962  6
2019-01-04  0.484171  0.129485  0.288674  6
2019-01-05  2.574851  0.625801  0.057813  6
2019-01-06  0.114704  0.135280  0.347109  6

In [45]:
# 判断DataFrame中的元素是否nan
pd.isna(df)

                A      B      C      D
2019-01-01  False  False  False  False
2019-01-02   True  False  False  False
2019-01-03  False   True  False  False
2019-01-04  False  False  False  False
2019-01-05  False  False  False  False
2019-01-06  False  False  False  False

# 函数操作

In [46]:
# 获取最大值
print(df)
df.max()

                   A         B         C  D
2019-01-01  0.000000  0.000000  0.188524  6
2019-01-02       NaN  0.333428  0.629147  6
2019-01-03  0.988711       NaN  0.735962  6
2019-01-04  0.484171  0.129485  0.288674  6
2019-01-05  2.574851  0.625801  0.057813  6
2019-01-06  0.114704  0.135280  0.347109  6

A    2.574851
B    0.625801
C    0.735962
D    6.000000
dtype: float64

In [47]:
# 获取最小值
df.min()

A    0.000000
B    0.000000
C    0.057813
D    6.000000
dtype: float64

In [48]:
# 获取平均值
df.mean()

A    0.832487
B    0.244799
C    0.374538
D    6.000000
dtype: float64

In [49]:
# 获取标准差
df.std()

A    1.047593
B    0.244047
C    0.260190
D    0.000000
dtype: float64

In [50]:
# 获取最大值的索引
df.idxmax()

A   2019-01-05
B   2019-01-05
C   2019-01-03
D   2019-01-01
dtype: datetime64[ns]

In [51]:
# 累计求和
df.cumsum()

                   A         B         C     D
2019-01-01  0.000000  0.000000  0.188524   6.0
2019-01-02       NaN  0.333428  0.817671  12.0
2019-01-03  0.988711       NaN  1.553633  18.0
2019-01-04  1.472882  0.462913  1.842306  24.0
2019-01-05  4.047733  1.088714  1.900119  30.0
2019-01-06  4.162437  1.223994  2.247228  36.0

In [52]:
# 理解axis参数 - 见PPT
df.max(axis=0) 
df.max(axis="index")
df.max(axis=1)
df.max(axis="columns")

2019-01-01    6.0
2019-01-02    6.0
2019-01-03    6.0
2019-01-04    6.0
2019-01-05    6.0
2019-01-06    6.0
Freq: D, dtype: float64

In [53]:
# 计算相关系数
df.corr()

          A         B         C   D
A  1.000000  0.985052 -0.271959 NaN
B  0.985052  1.000000 -0.190629 NaN
C -0.271959 -0.190629  1.000000 NaN
D       NaN       NaN       NaN NaN

In [54]:
# 计算每一个值出现的次数
df['A'].value_counts()

0.988711    1
0.114704    1
0.484171    1
2.574851    1
0.000000    1
Name: A, dtype: int64

In [55]:
# 移动数据
df.shift(1)

                   A         B         C    D
2019-01-01       NaN       NaN       NaN  NaN
2019-01-02  0.000000  0.000000  0.188524  6.0
2019-01-03       NaN  0.333428  0.629147  6.0
2019-01-04  0.988711       NaN  0.735962  6.0
2019-01-05  0.484171  0.129485  0.288674  6.0
2019-01-06  2.574851  0.625801  0.057813  6.0

In [56]:
# 自定义函数
df.apply(lambda x: x.max()-x.min())

A    2.574851
B    0.625801
C    0.678149
D    0.000000
dtype: float64

# 练习三 - 见PPT

In [57]:
# 移动窗口函数，rolling函数的计算过程见PPT
df['A'].rolling(window=3).mean()
df['A'].rolling(window=3).apply(lambda x: x.max()-x.min())

/Users/shenzhongqiang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Currently, 'apply' passes the values as ndarrays to the applied function. In the future, this will change to passing it as Series objects. You need to specify 'raw=True' to keep the current behaviour, and you can pass 'raw=False' to silence this warning
  This is separate from the ipykernel package so we can avoid doing imports until

2019-01-01         NaN
2019-01-02         NaN
2019-01-03         NaN
2019-01-04         NaN
2019-01-05    2.090680
2019-01-06    2.460146
Freq: D, Name: A, dtype: float64

# 练习四 - 见PPT

In [58]:
# 移除重复数据
data = pd.DataFrame({'a': ['one']*3+['two']*3,
  'b': [1,1,1,2,2,2]})
data.duplicated()
data.drop_duplicates()
data.drop_duplicates(['b'])
data.drop_duplicates(['b'], keep="last")

     a  b
2  one  1
5  two  2

# 数据的连接和合并

In [59]:
# 使用concat连接数据

In [60]:
# 先定义几个DataFrame
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'], 'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'], 'D':['D0','D1','D2','D3']},
                   index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [61]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'], 'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'], 'D':['D4','D5','D6','D7']},
                   index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [62]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'], 'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'], 'D':['D8','D9','D10','D11']},
                   index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
# 相同字段的表首尾相接，图见PPT
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [64]:
# 要在相接的时候识别数据源自于哪张表，可以增加key参数
pd.concat([df1,df2,df3], keys=['x', 'y', 'z'])

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [65]:
# 横向连接，行对齐
# 指定axis=1
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                     'D': ['D2', 'D3', 'D6', 'D7'],
                     'F': ['F2', 'F3', 'F6', 'F7']},
                    index=[2, 3, 6, 7])
pd.concat([df1, df4], axis=1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [66]:
# 使用merge合并(join)数据

In [67]:
# join的几种方式，见PPT

In [68]:
# 在一个key上作inner join，图见PPT
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [69]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [70]:
# 默认作inner join
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [71]:
# 在多个key上做join，图见PPT
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                      'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [72]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                       'key2': ['K0', 'K0', 'K0', 'K0'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [73]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [74]:
# left join，图见PPT
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [75]:
# right join，图见PPT
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [76]:
# outer join，图见PPT
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [77]:
# 通过how参数的指定作inner join，inner join也是默认的join方式，图见PPT
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [78]:
# join的两个DataFrame存在相同列名，pandas会自动对它们重新命名，图见PPT
left = pd.DataFrame({'A': [1, 2], 'B': [2, 2]})
left

   A  B
0  1  2
1  2  2

In [79]:
right = pd.DataFrame({'A': [4, 5, 6], 'B': [2, 2, 2]})
right

   A  B
0  4  2
1  5  2
2  6  2

In [80]:
pd.merge(left, right, on='B', how='outer')

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6

In [81]:
# 用索引作join
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [82]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                       'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [83]:
# 作left join，图见PPT
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [84]:
# 作outer join，图见PPT
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [85]:
# 作inner join，图见PPT
left.join(right, how='inner')
# 用merge也可以实现同样的功能
pd.merge(left, right, left_index=True, right_index=True, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [86]:
# 列和索引作join，图见PPT
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3'],
                      'key': ['K0', 'K1', 'K0', 'K1']})
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K0
3  A3  B3  K1

In [87]:
right = pd.DataFrame({'C': ['C0', 'C1'],
                       'D': ['D0', 'D1']},
                      index=['K0', 'K1'])
right

     C   D
K0  C0  D0
K1  C1  D1

In [88]:
pd.merge(left, right, left_on='key', right_index=True, how='left', sort=False)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

# 数据分组与聚合

In [89]:
# groupby机制，见PPT

In [90]:
# 分组后计算每一组的平均值，分组图示见PPT
df = pd.DataFrame({
  'sex':['F','M','F','M','M'],
  'height': [170,165,175,172,180],
  'weight': [55,66,60,70,65]})

df_gb = df.groupby("sex")
for index, data in df_gb:
    print("group: ", index)
    print("data: \n", data)

df.groupby(['sex']).mean()

group:  F
data:
   sex  height  weight
0   F     170      55
2   F     175      60
group:  M
data:
   sex  height  weight
1   M     165      66
3   M     172      70
4   M     180      65

         height  weight
sex
F    172.500000    57.5
M    172.333333    67.0

In [91]:
# 使用agg作聚合操作
df.groupby(['sex']).agg(['mean', 'std'])

         height           weight
           mean       std   mean       std
sex
F    172.500000  3.535534   57.5  3.535534
M    172.333333  7.505553   67.0  2.645751

In [92]:
# 对不同列作不同的聚合操作，可以用给agg传入字典形式的参数
df.groupby('sex').agg({'height': ['mean', 'std'], 'weight': ['mean']})

         height           weight
           mean       std   mean
sex
F    172.500000  3.535534   57.5
M    172.333333  7.505553   67.0

In [93]:
# agg中传入自定义函数
peak_to_peak = lambda x: x.max() - x.min()
df.groupby(['sex']).agg(peak_to_peak)

     height  weight
sex
F         5       5
M        15       5

# 练习五 - 见PPT

# 透视表和交叉表

In [94]:
# 透视表 pivot table
# 透视表是一种常见的数据汇总工具，根据一个或者多个键对数据进行聚合，并根据行、列分组将数据分配到各个矩形区域
df = pd.DataFrame({
  'sex':['F','M','F','M','M'],
  'height': [150,155,175,172,180],
  'weight': [55,66,60,70,65],
  'age': [10, 15, 25, 35, 30]})

# 年龄离散化
df["age"] = pd.cut(df["age"], [0, 18, 90])
df

  sex  height  weight       age
0   F     150      55   (0, 18]
1   M     155      66   (0, 18]
2   F     175      60  (18, 90]
3   M     172      70  (18, 90]
4   M     180      65  (18, 90]

In [95]:
# index指定透视表建立时要根据哪些字段进行分组
# values指对哪些字段进行聚合操作
# aggfunc指定聚合函数，默认的聚合函数是mean，也就是求平均值
# 分解步骤见PPT
pd.pivot_table(df, index="sex", values="height", aggfunc='mean')

     height
sex
F     162.5
M     169.0

In [96]:
# 添加列索引，按不同值分组
# 分解步骤见PPT
pd.pivot_table(df, index="sex", columns="age", values="height", aggfunc='mean')

age  (0, 18]  (18, 90]
sex
F        150       175
M        155       176

In [97]:
# 添加多个聚合列
pd.pivot_table(df, index="sex", values=["height", "weight"], aggfunc='mean')

     height  weight
sex
F     162.5    57.5
M     169.0    67.0

In [98]:
# 多个聚合函数
# aggfunc传入list，则每个聚合函数对每个列都进行一次聚合
pd.pivot_table(df, index="sex", values="height", aggfunc=['mean', 'max'])

      mean    max
    height height
sex
F    162.5    175
M    169.0    180

In [99]:
# aggfunc传入dict，则每个列仅对其指定的函数进行聚合，此时values参数可以不传
pd.pivot_table(df, index="sex", aggfunc={"height": 'mean', "weight": 'max'})

     height  weight
sex
F     162.5      60
M     169.0      70

In [100]:
# 添加汇总项
# 按行、按列进行汇总，指定汇总列名为 “Total”，默认名为 “ALL”
pd.pivot_table(df, index="sex", values="height", aggfunc='count', margins=True, margins_name="Total")

       height
sex
F           2
M           3
Total       5

In [101]:
# 交叉表 cross table
# 交叉表是一种常用的分类汇总表格，用于频数分布统计
# 默认计算频数
pd.crosstab(index=df.sex, columns=df.age)

age  (0, 18]  (18, 90]
sex
F          1         1
M          1         2

In [102]:
# aggfunc用来指定聚合函数，默认为统计频数
pd.crosstab(index=df.sex, columns=df.age, values=df.weight, aggfunc=sum)

age  (0, 18]  (18, 90]
sex
F         55        60
M         66       135

In [103]:
# 添加汇总项
pd.crosstab(index=df.sex, columns=df.age, margins=True, margins_name="Total")

age    (0, 18]  (18, 90]  Total
sex
F            1         1      2
M            1         2      3
Total        2         3      5

# 练习六 - 见PPT

# pandas读写csv

In [104]:
# 保存dataframe到csv
df = pd.DataFrame({
  'sex':['F','M','F','M','M'],
  'height': [150,155,175,172,180],
  'weight': [55,66,60,70,65]})
df.to_csv("people.csv")

In [105]:
# 读取csv到dataframe
df2 = pd.read_csv("people.csv", index_col=0)
df2

  sex  height  weight
0   F     150      55
1   M     155      66
2   F     175      60
3   M     172      70
4   M     180      65

# 实战项目一 - 见PPT

In [106]:
df = pd.read_csv("jobs.csv")

In [107]:
df.drop_duplicates(inplace=True)

In [108]:
df.head()

,title,company,company_size,industry,type,salary,company_type,source,experience,education,salary2
0,招聘数据分析师,北京越铖国际科技有限公司,20-99人,人事/行政/高级管理,全职,8000-12000,民营,斗米,不限,不限,10000.0
1,数据分析师,北京新东方教育科技（集团）有限公司,NaN,计算机/互联网/信息技术,全职,12000-20000,民营,OFweek人才网,不限,不限,16000.0
2,数据分析师(新浪),新浪网技术(中国)有限公司,2000-5000人,数据分析师,全职,20000-25000,外商独资/办事处,猎聘,3-5年,本科,22500.0
3,数据分析师,北京美科思远环境科技有限公司,20-99人,环保/环境科学类,全职,12000-20000,股份制,北极星招聘,不限,硕士,16000.0
4,助理、临床样本库采样人员、软件工程师、数据库管理工程师、机械设计与结构工程师、Android...,中国人民解放军总医院（北京市解放军医学院）,NaN,医疗,全职,面议,公立医院,康强医疗人才网,不限,不限,NaN

In [109]:
# 招聘职位都来自于哪些招聘网站
s_source = df["source"].value_counts()
s_source

猎聘           580
OFweek人才网     33
斗米            17
百姓网            5
北极星招聘          5
普工招聘网          4
工厂直聘网          2
康强医疗人才网        1
Name: source, dtype: int64

In [110]:
# 不同类型公司的职位数量
s_comptype = df["company_type"].value_counts(ascending=True)
s_comptype

其它            1
公立医院          1
股份制           1
个人企业          2
事业单位          4
国企           34
中外合资/合作      42
外商独资/办事处     45
上市公司         62
民营          458
Name: company_type, dtype: int64

In [111]:
# 职位对于教育背景的要求
s_edu = df["education"].value_counts()
s_edu

本科    489
不限     71
硕士     54
大专     26
初中      9
博士      1
Name: education, dtype: int64

In [112]:
# 所有职位的平均工资
df["salary2"].mean()

14409.894688644688

In [113]:
# 哪些公司发布的职位最多
df_numbers = df.groupby("company")["title"].agg(job_count="count")
df_numbers.sort_values("job_count", ascending=False).tail(10)

                   job_count
company
北京捷越联合信息咨询有限公司             1
北京我爱小城信息科技有限公司             1
北京慧融天下信息科技有限公司             1
北京悦优博迈科技有限公司               1
北京怡合春天科技有限公司               1
北京思维造物信息科技股份有限公司           1
北京快融保金融信息服务股份有限公司          1
苏州辽翼电子科技有限公司               0
伊都（上海）货运代理有限公司             0
苏州横唐电子科技有限公司               0

In [114]:
# 哪些公司的工资最高
df_avgsalary = df.groupby("company")["salary2"].agg(avgsalary="mean")
df_avgsalary.sort_values("avgsalary", ascending=False).head(10)

                    avgsalary
company
xx公司                  25000.0
欧科互动网络科技(北京)有限公司      25000.0
中商利高科技(北京)有限公司        25000.0
北京某互联网公司              25000.0
中建材信息技术股份有限公司         25000.0
北京奇元科技有限公司            25000.0
某互联网公司                25000.0
清控紫荆(北京)教育科技股份有限公司    25000.0
中网数据(北京)股份有限公司        25000.0
北京城市网邻信息技术有限公司        25000.0

In [115]:
# 不同类型公司的平均工资
df_avgsalary2 = df.groupby("company_type")["salary2"].agg(avgsalary="mean")
df_avgsalary2.sort_values("avgsalary", ascending=False)

                 avgsalary
company_type
外商独资/办事处      17468.750000
股份制           16000.000000
民营            14378.595718
上市公司          14367.346939
事业单位          14166.666667
中外合资/合作       13357.142857
个人企业          13250.000000
国企            12846.153846
其它            10000.000000
公立医院                   NaN

# 实战项目二 - 见PPT

In [116]:
df = pd.read_csv("houses.csv", sep='>', index_col=0)
df = df.drop_duplicates(["title", "price",
                    "xiaoqu_name", "size",
                    "buildyear", "huxing",
                    "chaoxiang", "zhuangxiu",
                    "cenggao", "district_name",
                    "sub_district_name"])
df.head()

,_id,title,price,up_price,xiaoqu_name,size,buildyear,huxing,chaoxiang,zhuangxiu,cenggao,louxing,district_name,sub_district_name
0,5dd2198f18bba2b4a9a0b854,大华电梯两房/房型正气/开门南北通/房东诚意出售,690.0,76531.0,大华锦绣华城(十六街区)(公寓),90.16,2010,2室2厅,南,简装,中楼层(共18层),板楼,浦东,北蔡
1,5dd2198f18bba2b4a9a0b855,非底楼 满五年唯一 税费少 婚房装修 楼称佳 户型方正,330.0,52290.0,芳雅苑,63.11,1995,2室1厅,南,精装,低楼层(共6层),板楼,浦东,北蔡
2,5dd2198f18bba2b4a9a0b856,满五唯一+7号线锦绣路+复式房+带阁楼+小区央位+精装,500.0,62878.0,锦博苑,79.52,2007,2室2厅,南,精装,高楼层(共6层),板楼,浦东,北蔡
3,5dd2198f18bba2b4a9a0b857,13号线陈春路地铁400米中间楼层诚意卖看房方便,330.0,45866.0,鹏海小区,71.95,1997,2室1厅,南,简装,中楼层(共6层),板楼,浦东,北蔡
4,5dd2198f18bba2b4a9a0b858,朝阳正气一房，采光好，坐看花园，户型方正，看房方便,460.0,83942.0,万邦都市花园,54.80,2004,1室1厅,南,简装,中楼层(共11层),板楼,浦东,北蔡

In [117]:
# 获取一共有多少套房源
len(df)

73624

In [118]:
# 查看列
df.columns

Index(['_id', 'title', 'price', 'up_price', 'xiaoqu_name', 'size', 'buildyear',
       'huxing', 'chaoxiang', 'zhuangxiu', 'cenggao', 'louxing',
       'district_name', 'sub_district_name'],
      dtype='object')

In [119]:
# 获取不同的小区的数量
len(df.xiaoqu_name.unique())

8594

In [120]:
# 获取区和板块的数量
len(df.district_name.unique())
len(df.sub_district_name.unique())

165

In [121]:
# 获取不同的楼型的值
df.louxing.unique()

array([' 板楼', ' 塔楼', nan, ' 板楼 ', ' 板塔结合', ' 暂无数据', ' 平房', ' 塔楼 ', ' 平房 ',
       ' 暂无数据 '], dtype=object)

In [122]:
# 获取不同的户型的值
df.huxing.unique()

array(['2室2厅 ', '2室1厅 ', '1室1厅 ', '4室3厅 ', '3室1厅 ', '3室2厅 ', nan, '4室2厅 ',
       '1室2厅 ', '2室0厅 ', '5室1厅 ', '1室0厅 ', '5室3厅 ', '5室2厅 ', '4室1厅 ',
       '4室4厅 ', '6室3厅 ', '5室6厅 ', '6室2厅 ', '5室4厅 ', '7室3厅 ', '3室3厅 ',
       '9室2厅 ', '7室2厅 ', '7室1厅 ', '6室4厅 ', '6室1厅 ', '8室4厅 ', '3室0厅 ',
       '7室4厅 ', '7室5厅 ', '4室5厅 ', '9室6厅 ', '9室4厅 ', '6室5厅 ', '10室1厅 ',
       '4室0厅 ', '8室1厅 ', '9室3厅 ', '9室9厅 ', '5室5厅 ', '8室3厅 ', '2室3厅 ',
       '7室6厅 ', '8室2厅 ', '0室0厅 ', '6室6厅 ', '10室6厅 ', '2室4厅 ', '6室0厅 ',
       '10室2厅 ', '7室0厅 ', '3室4厅 ', '8室5厅 ', '10室3厅 ', '5室0厅 ', '3室5厅 '],
      dtype=object)

In [123]:
# 不同的户型的房源数量
df.groupby("huxing")["huxing"].count().sort_values()

huxing
9室9厅          1
3室5厅          1
3室4厅          1
6室6厅          1
7室0厅          1
2室4厅          1
5室0厅          1
8室1厅          1
4室5厅          1
9室3厅          1
10室6厅         1
10室3厅         1
10室2厅         1
10室1厅         1
8室5厅          1
7室6厅          2
6室0厅          2
5室5厅          2
9室6厅          2
7室1厅          2
9室4厅          3
5室6厅          3
4室0厅          3
9室2厅          4
0室0厅          4
7室5厅          5
8室4厅          5
8室3厅          6
6室5厅          7
2室3厅          8
8室2厅          9
7室4厅          9
6室1厅         11
4室4厅         21
7室2厅         30
5室1厅         32
7室3厅         36
6室4厅         49
5室4厅         51
3室0厅        108
3室3厅        134
4室1厅        147
6室2厅        148
6室3厅        182
4室3厅        578
5室3厅        588
5室2厅        860
1室2厅       1198
2室0厅       1383
1室0厅       1926
3室1厅       3470
4室2厅       3637
1室1厅      12180
3室2厅      12712
2室2厅      13080
2室1厅      17452
Name: huxing, dtype: int64

In [124]:
# 获取不同的装修情况的值
df.zhuangxiu.unique()

array([' 简装 ', ' 精装 ', ' 毛坯 ', nan, ' 其他 '], dtype=object)

In [125]:
# 获取不同的建造年份的值
df[df.buildyear>0].buildyear.unique()

array([2010, 1995, 2007, 1997, 2004, 1994, 2011, 2012, 1998, 2013, 1999,
       2016, 2000, 2005, 1996, 2003, 2015, 2006, 2009, 1993, 2002, 2014,
       1992, 2008, 2001, 2019, 2018, 1987, 1991, 2017, 1989, 1988, 1982,
       1983, 1984, 1981, 1985, 2104, 1977, 1986, 1990, 1979, 1980, 1953,
       1976, 1958, 1978, 1969, 1974, 1975, 1955, 1971, 1954, 1956, 1959,
       1968, 1964, 1960, 1967, 1972, 1961, 1973, 1936, 1911, 1941, 1948,
       1949, 1940, 1939, 1933, 1946, 1937, 1910, 1945, 1957, 1965, 1966,
       1970, 1963, 1950, 1962, 1930, 1920, 1947, 1938, 1934, 1935, 1921,
       1926, 1912, 1924, 1928, 1931, 1943, 1900, 1952, 1951])

In [126]:
# 获取不同的建造年份的房源数量
df[df.buildyear>0].groupby("buildyear")["buildyear"].count().sort_values()

buildyear
1900       1
1910       1
1952       1
1951       1
1921       1
        ...
1997    3112
2006    3300
2005    3547
1995    3970
1994    4027
Name: buildyear, Length: 97, dtype: int64

In [127]:
# 获取总价的平均值
df.price.mean()

569.6518825383016

In [128]:
# 获取房源面积的平均值
df["size"].mean()

97.62337512224236

In [129]:
# 获取每个区的平均总价
df.groupby("district_name")["price"].mean()

district_name
嘉定     343.817812
奉贤     231.706226
宝山     374.185986
徐汇     692.798507
普陀     480.165730
杨浦     479.116338
松江     531.589955
浦东     606.343368
虹口     583.969836
金山     176.731027
长宁     740.272438
闵行     565.856917
青浦     745.521928
静安     703.897629
黄浦    1166.871810
Name: price, dtype: float64

In [130]:
# 获取每个区的房源数量
df.groupby("district_name")["district_name"].count().sort_values()

district_name
金山      925
青浦     1660
奉贤     2072
黄浦     2100
虹口     2324
长宁     3679
嘉定     4059
静安     4429
普陀     4555
徐汇     4556
松江     4669
杨浦     4872
宝山     5145
闵行     9853
浦东    18726
Name: district_name, dtype: int64

In [131]:
# 获取最贵的房源
df.sort_values(by="price", ascending=False).head(5)

,_id,title,price,up_price,xiaoqu_name,size,buildyear,huxing,chaoxiang,zhuangxiu,cenggao,louxing,district_name,sub_district_name
48887,5dd22309303c5558c090e6d9,花园18亩 开门见3座山 背面靠山 南东2面临天然大河,35000.0,191890.0,世茂佘山庄园,1823.97,2008,6室3厅,南,毛坯,2层,板楼,松江,佘山
19869,5dd21bf518bba2b4a9a1061f,罕见！占地10亩庄园，整个园区的King！让上海都在仰望,30000.0,156613.0,绿城玫瑰园,1915.56,2013,6室4厅,南,毛坯,2层,板楼,闵行,马桥
48943,5dd22309303c5558c090e711,仟万精装、华庭岛屿大独栋！5亩占地、自住！价格可谈,30000.0,189672.0,佘山高尔夫郡,1581.68,2009,6室3厅,南 北,精装,2层,板楼,松江,佘山
29721,5dd21d0718bba2b4a9a12cb3,安福路/常熟路 沿街独幢花园洋房，英式风格 地价已补,24999.0,527406.0,常熟路182号,474.00,1937,6室3厅,南,精装,低楼层(共3层),板塔结合,徐汇,衡山路
8256,5dd21a7f18bba2b4a9a0d8a5,世茂顶楼复式，带游泳池，带450平大露台,24000.0,222093.0,世茂滨江花园,1080.63,0,NaN,NaN,NaN,NaN,NaN,浦东,陆家嘴

In [132]:
# 获取每个小区的均价
df.groupby("xiaoqu_name")["up_price"].mean().sort_values()

xiaoqu_name
广丰路289弄       11425.000000
南桥金水领寓        11552.000000
石化一村          12144.000000
万寿新村(金山)      12680.000000
金山银海          12980.000000
                 ...
兴国路322号      318560.500000
复兴西路299弄     356385.666667
霞飞别墅         369767.000000
良友别墅         393443.000000
常熟路182号      527406.000000
Name: up_price, Length: 8594, dtype: float64

In [133]:
# 获取每个小区的房源数量
df_num = df.groupby("xiaoqu_name")["title"].agg(house_num="count")
df_num = df_num[df_num.house_num>10]
df_num

                house_num
xiaoqu_name
MAX未来                  19
一品漫城(一期)(公寓)           16
一品漫城(四期)(公寓)           21
一品漫城二期（公寓）             18
万业新阶                   31
...                   ...
龙源星城                   34
龙盛佳苑                   23
龙盛国际商业广场(商业类)          12
龚华新村                   16
龚路新城                   17

[2282 rows x 1 columns]

In [134]:
# 对于至少有10套房源的小区，计算这些小区的均价
df2 = pd.merge(df_num, df, on="xiaoqu_name")
df2.groupby("xiaoqu_name")["up_price"].mean().sort_values()

xiaoqu_name
飞虹南村            13508.090909
飞虹北村            14092.750000
石化九村            14519.818182
石化四村            14536.818182
石化十村            14864.800000
                   ...
华侨城苏河湾(公寓)     164137.000000
御翠园            165054.800000
翠湖天地嘉苑         168916.578947
滨江凯旋门          173278.375000
翠湖天地隽荟         175454.923077
Name: up_price, Length: 2282, dtype: float64